Autodesk.Revit.Exceptions.ArgumentException.ParamName
Gets the name of the parameter that causes this exception.

Autodesk.Revit.Exceptions.ArgumentException.Message
Gets the error message and the parameter name, or only the error message if no parameter name is set.
Remarks: The text of Message should completely describe the error and should, when possible, explain how to correct it.

Autodesk.Revit.Exceptions.ArgumentException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.ArgumentException
The exception that is thrown when one of the arguments provided to a method is not valid.
Remarks: This is the base class for exceptions that are thrown while validating the arguments to a function.